<!--   생활 코딩 중 자바스크립트 --> <!-- 01_오리엔테이션-->

// 웹브라우저 : 브라우저를 제어하기 위한 언어 (=프로그래밍적 제어)로는 js가 유일함
// 탈웹브라우저: js는 더이상 웹브라우저를 제어하기만 위해서 쓰지는 않음. 요새는 웹서버를 제어하기 위한 기술로서도 js가 가능해짐.
// 탈웹: 웹 바깥 기술에도 js가 쓰이기 시작함 <예>googleAppsScript 구글스프레드시티(온라인엑셀)

// 웹브라우저 ----------------------------------------웹[인터넷]--------------------------------------------웹서버
// 웹브라우저를 제어하기 위한 기술로서의 js                                              웹서버를 제어하기 위한 기술로서의 PHP, Java, Python, Ruby,

// 언어란? <예> 한국어로는 '~해 주세요', JavaScript로는 '~('Hello World');의 방식으로
// 환경이란? <예> 변호사에게 '변호해주세요', 개발자에게 '개발해주세요', ~대신에 웹브라우저에게 'alert', node.js에게 'write', SpreadSheet에 'msgBox' => msgBod('Hello World');


<html>
<body>
<input type="button" onClick="alert('Hello World')" value="Hello World"/>
</body>
</html>